<?php
/**
 * Компонент мобильного меню
 * Простая структура без кнопки закрытия
 */
?>

<div class="side-menu" data-menu>
  <div class="side-menu__top space-lg">
    <p class="side-menu__title text-md-regular color-white">Меню</p>
    <button class="side-menu__back-btn text-md-regular btn-reset" data-menu-back style="display: none;">
      <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
        <path
          d="M4.76758 2.10059C5.07992 1.78845 5.58606 1.78851 5.89844 2.10059C6.2108 2.41294 6.21067 2.91901 5.89844 3.23145L5.26367 3.86621H8.77734V4.66602C8.77734 3.91849 8.77793 3.86937 8.77832 3.86621H8.80176C8.81343 3.8664 8.82901 3.86657 8.84766 3.86719C8.88556 3.86846 8.93813 3.87142 9.00195 3.87598C9.12947 3.88509 9.30653 3.9025 9.5166 3.9375C9.93356 4.007 10.5023 4.14762 11.0801 4.43652C11.661 4.727 12.2663 5.17596 12.7246 5.86328C13.1861 6.55557 13.4667 7.44293 13.4668 8.55469V13.999C13.4668 14.4407 13.1086 14.7995 12.667 14.7998C12.2528 14.7998 11.912 14.4845 11.8711 14.0811L11.8662 13.999V8.55469C11.8661 7.72283 11.661 7.15117 11.3936 6.75C11.1227 6.34394 10.7553 6.06272 10.3643 5.86719C9.97009 5.67016 9.56598 5.56765 9.25391 5.51562C9.09984 5.48995 8.97276 5.47776 8.8877 5.47168L8.77637 5.46582H5.26367L5.89844 6.10059C6.2108 6.41294 6.21067 6.91901 5.89844 7.23145C5.58602 7.54386 5.08 7.54386 4.76758 7.23145L2.76758 5.23145L2.20117 4.66602L2.76758 4.10059L4.76758 2.10059Z"
          fill="white" />
      </svg>
      <span class="text-md-regular color-white">Назад</span>
    </button>
  </div>
  <div class="space-xxl js-insert-nav"></div>
  <div class="side-menu__group">
    <div class="js-insert-contacts"></div>
  </div>
</div>